

//Процедура ПередЗапускомТеста() Экспорт   
//	
//	ПодготовитьТестовыеДанные();
//	
//КонецПроцедуры  

//Процедура ТестСозданиеДокументов() Экспорт 
//	
//	ДокументыПрихода = СоздатьДокументыПрихода(3);
//	ДокументыРасхода = СоздатьДокументыРасхода(3);
//	
//	Для каждого Док Из ДокументыПрихода Цикл
//		
//		Ожидаем.Что(Док.Ссылка).НеРавно(Неопределено);
//		
//		
//	
//		
//	
//	КонецЦикла;
//	

//	

//КонецПроцедуры     

//Функция СоздатьДокументыПрихода(Количество)

//	

//КонецФункции // ()        

//Функция СоздатьДокументыРасхода(Количество)

//	

//КонецФункции // ()




//Процедура ПодготовитьТестовыеДанные() 

//	

//КонецПроцедуры

