
#Область СлужебныйПрограммныйИнтерфейс 

Процедура ИсполняемыеСценарии() Экспорт 
	
	ЮТТесты.ДобавитьТестовыйНабор("ДЗ").ВТранзакции()
	.ДобавитьТест("ТестСозданиеДокументов", "Создание документов", "Позитив, Лоскутов Алексей, Task-1")  
	.ДобавитьТест("ТестПроведениеДокументов", "Проведение документов", "Позитив, Лоскутов Алексей, Task-1")
	.ДобавитьТест("ТестПроверкаОстатковТоварныеЗапасыПозитив", "Проверка остатков", "Позитив") 
	.ДобавитьТест("ТестПроверкаОстатковТоварныеЗапасыНегатив", "Проверка остатков", "Негатив")
	.ДобавитьТест("ТестПроверкаОстатковВзаиморасчетыПозитив", "Проверка остатков", "Позитив")
	.ДобавитьТест("ТестПроверкаОстатковВзаиморасчетыНегатив", "Проверка остатков", "Негатив")
	;
	
КонецПроцедуры     

Процедура ТестСозданиеДокументов() Экспорт   
	
	//1. подготовка параметров и генрация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Склад = Справочники.Склады.НайтиПоКоду("000000001"); 
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);  
	
	//2. выполнения функции
	ДокументыПрихода = СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма).Записать(Истина);
	ДокументыРасхода = СоздатьДокументыРасхода(Контрагент, Товар, Количество, Сумма).Записать(Истина);
	
	//3. проверка результата
	ЮТест.ОжидаетЧто(ДокументыПрихода).Метод("Записать").НеВыбрасываетИсключение();		
	ЮТест.ОжидаетЧто(ДокументыРасхода).Метод("Записать").НеВыбрасываетИсключение();	
	
КонецПроцедуры  

Процедура ТестПроведениеДокументов() Экспорт     
	
	//1. подготовка параметров и генрация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Склад = Справочники.Склады.НайтиПоКоду("000000001"); 
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);	
	
	//2. выполнения функции
	ДокументыПрихода = СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма).Записать(Истина);
	ДокументыРасхода = СоздатьДокументыРасхода(Контрагент, Товар, Количество, Сумма).Записать(Истина); 
	
	//3. проверка результата
	ЮТест.ОжидаетЧто(ДокументыПрихода).Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение).НеВыбрасываетИсключение();
	Движения = ЮТЗапросы.ДвиженияДокумента(ДокументыПрихода.Ссылка, "ТоварныеЗапасы");
	ЮТест.ОжидаетЧто(Движения.Количество()).Больше(0);	
	ЮТест.ОжидаетЧто(ДокументыРасхода).Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение).НеВыбрасываетИсключение();
	Движения = ЮТЗапросы.ДвиженияДокумента(ДокументыРасхода.Ссылка, "ТоварныеЗапасы");
	ЮТест.ОжидаетЧто(Движения.Количество()).Больше(0);  	
	
КонецПроцедуры 

Процедура ТестПроверкаОстатковТоварныеЗапасыПозитив() Экспорт  
	
	//1. подготовка параметров и генрация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Склад = Справочники.Склады.НайтиПоКоду("000000001"); 
	ТоварНаименование = "НовыйТестовыйТовар";
	Товар = СозданиеТовара(ТоварНаименование); 
	
	//2. выполнения функции
	ДокументОбъект1 = СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект3 = СоздатьДокументыРасхода(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект4 = СоздатьДокументыРасхода(Контрагент, Товар, Количество, Сумма).Провести();
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Склад");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Товар");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("КоличествоОстаток");
	ОписаниеЗапроса.Условия.Добавить("Склад = &Склад");
	ОписаниеЗапроса.Условия.Добавить("Товар = &Товар");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Склад", Склад);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", Товар);
	Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса);   
	
	//3. проверка результата
	ЮТест.ОжидаетЧто(Результат)
	.НеЗаполнено()
	;
		
КонецПроцедуры   

Процедура ТестПроверкаОстатковТоварныеЗапасыНегатив() Экспорт 
	
	//1. подготовка параметров и генрация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Склад = Справочники.Склады.НайтиПоКоду("000000001"); 
	ТоварНаименование = "НовыйТестовыйТовар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	//2. выполнения функции
	ДокументОбъект1 = СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект3 = СоздатьДокументыРасхода(Контрагент, Товар, 10, Сумма).Провести();
	ДокументОбъект4 = СоздатьДокументыРасхода(Контрагент, Товар, Количество, Сумма).Провести();
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Склад");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Товар");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("КоличествоОстаток");
	ОписаниеЗапроса.Условия.Добавить("Склад = &Склад");
	ОписаниеЗапроса.Условия.Добавить("Товар = &Товар");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Склад", Склад);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", Товар);
	Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса); 
	
	//3. проверка результата
	ЮТест.ОжидаетЧто(Результат).Свойство("[0].КоличествоОстаток").НеРавно(0); 
	
КонецПроцедуры  

Процедура ТестПроверкаОстатковВзаиморасчетыПозитив() Экспорт 
	
	//1. подготовка параметров и генрация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Валюта = Справочники.Валюты.НайтиПоКоду("000000001"); 
	ТоварНаименование = "НовыйТестовыйТовар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	//2. выполнения функции
	ДокументОбъект1 = СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект3 = СоздатьДокументыРасхода(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект4 = СоздатьДокументыРасхода(Контрагент, Товар, Количество, Сумма).Провести();
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Остатки";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Валюта");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Контрагент");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("СуммаОстаток");
	ОписаниеЗапроса.Условия.Добавить("Валюта = &Валюта");
	ОписаниеЗапроса.Условия.Добавить("Контрагент = &Контрагент");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Контрагент", Контрагент);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Валюта", Валюта);
	Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса);
	
	//3. проверка результата
	ЮТест.ОжидаетЧто(Результат)
	.НеЗаполнено()
	;
		
КонецПроцедуры 

Процедура ТестПроверкаОстатковВзаиморасчетыНегатив() Экспорт 
	
	//1. подготовка параметров и генрация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Валюта = Справочники.Валюты.НайтиПоКоду("000000001"); 
	ТоварНаименование = "НовыйТестовыйТовар";
	Товар = СозданиеТовара(ТоварНаименование); 
	
	//2. выполнения функции
	ДокументОбъект1 = СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект3 = СоздатьДокументыРасхода(Контрагент, Товар, Количество, 5000).Провести();
	ДокументОбъект4 = СоздатьДокументыРасхода(Контрагент, Товар, Количество, Сумма).Провести();
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Остатки";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Валюта");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Контрагент");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("СуммаОстаток");
	ОписаниеЗапроса.Условия.Добавить("Валюта = &Валюта");
	ОписаниеЗапроса.Условия.Добавить("Контрагент = &Контрагент");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Валюта", Валюта);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Контрагент", Контрагент);
	Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса); 
	
	//3. проверка результата
	ЮТест.ОжидаетЧто(Результат).Свойство("[0].СуммаОстаток").НеРавно(0); 
	
КонецПроцедуры
	
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции 

Функция СоздатьДокументыПрихода(Контрагент, Товар, Количество, Сумма) Экспорт  
	
	Склад = Справочники.Склады.НайтиПоКоду("000000001");
	Валюта = Справочники.Валюты.НайтиПоКоду("000000001");

	Конструктор = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Поставщик", Контрагент)
		.Установить("Склад", Склад)
		.Установить("Валюта", Валюта)
		.ТабличнаяЧасть("товары")
			.ДобавитьСтроку()
				.ФикцияОбязательныхПолей()
				.Установить("Товар", Товар)
				.Установить("Количество", Количество)
				.Установить("Сумма", Сумма);
 
	Возврат Конструктор;
	
КонецФункции // ()    

Функция СоздатьДокументыРасхода(Контрагент, Товар, Количество, Сумма)
	
	Склад = Справочники.Склады.НайтиПоКоду("000000001");
	Валюта = Справочники.Валюты.НайтиПоКоду("000000001");
	Конструктор = ЮТест.Данные().КонструкторОбъекта("Документ.РасходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Покупатель", Контрагент)
		.Установить("Склад", Склад)
		.Установить("Валюта", Валюта)
		.ТабличнаяЧасть("товары")
			.ДобавитьСтроку()
				.ФикцияОбязательныхПолей()
				.Установить("Товар", Товар)
				.Установить("Количество", Количество)
				.Установить("Сумма", Сумма);
	Возврат Конструктор;
	
КонецФункции // ()  

Функция СозданиеТовара(ТоварНаименование) Экспорт 
	
	Товар = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", ТоварНаименование)
		.Записать()
		;
	Возврат Товар;    
	
КонецФункции // () 

Функция СозданиеКонтрагента() Экспорт   
	
	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочники.Контрагенты")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "НовыйТестовыйКонтрагент")
		.Записать()
		;
	Возврат Контрагент;    
	
КонецФункции 
	
#КонецОбласти












