

Процедура ИсполняемыеСценарии() Экспорт 
	
	ЮТТесты
		.ДобавитьТест("СложениеБезПараметров")
		.ДобавитьТест("СложениеСПараметрами") 
			.СПараметрами(2, 3, 5)
		
		
		
		
		
		;

	

КонецПроцедуры
	
Процедура СложениеБезПараметров()Экспорт 
	
	//РезультатСложения = 2 + 2; 
	РезультатСложения = "2 + 2";
	ЮТест.ОжидаетЧто(РезультатСложения)  
		.ИмеетТип("Число")
		.Равно(4);

КонецПроцедуры    
	
Процедура СложениеСПараметрами(ПервыйОперанд, ВторойОперанд, Результат) Экспорт 
	
	РезультатСложения = ПервыйОперанд + ВторойОперанд;
	ЮТест.ОжидаетЧто(РезультатСложения)
		.Равно(Результат);

	

КонецПроцедуры
	
	
	
	
